{
  "backend/main.mo": "Motoko actor defining ContactEntry types and functions to submit, retrieve by ID, and get all contact entries stored in a List, with timestamp-based comparison support.",
  "feature_evidence.json": "Feature evidence report documenting three implemented features: displaying Gmail contact in Contact section, updating Services section with exclusivity notice, and adding Gmail to Footer component.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files including components (Hero, About, Services, Contact, Footer, ContactForm), hooks, styling, and UI utilities with warm construction-themed design.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color variables for light and dark modes, using warm, earthy tones suitable for a construction company theme.",
  "frontend/index.html": "HTML entry point with viewport meta tag, page title 'J M Construction Website', and root div mounting the React application from main.tsx.",
  "frontend/src/App.tsx": "Main React application component rendering the full single-page website layout with Hero, About, Services, Contact, and Footer sections in sequence.",
  "frontend/src/components/About.tsx": "About section component showcasing J M Construction's 30-year heritage, 8 years of specialized experience, and four key value propositions (Reliable, Professional, Timely, Quality) with icons and descriptions.",
  "frontend/src/components/Contact.tsx": "Contact section displaying company information (location, email jmconstruction.sp@gmail.com as mailto link, business hours) alongside the ContactForm component, with trust badges highlighting experience and quality.",
  "frontend/src/components/ContactForm.tsx": "React form component with validation for name, company, email, and message fields that submits to backend actor's submitContactEntry function, displaying success/error states with loading indicators.",
  "frontend/src/components/Footer.tsx": "Footer component displaying company info, quick links, services list, copyright notice, and attribution link to caffeine.ai with dynamic year and hostname-based UTM parameters.",
  "frontend/src/components/Hero.tsx": "Hero section component featuring company logo, name, location (Kolkata), tagline, three stat cards (8 years experience, 3 decades heritage, expert workmanship), CTA button, and animated scroll indicator over a background image with gradient overlay.",
  "frontend/src/components/Services.tsx": "Services section displaying six service cards (sanitary, plumbing, repairs, residential, commercial, system upgrades) with icons and features, plus an alert notice specifying the company only handles new residential apartment projects, not small maintenance work.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages an ICP actor instance based on Internet Identity authentication state, automatically invalidating and refetching dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options for ICP integration.",
  "frontend/src/hooks/useQueries.ts": "Custom React Query hooks for contact form operations: mutation hook for submitting contact entries and query hooks for fetching all entries or a single entry by ID using the ICP actor.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a warm, earthy construction-themed color palette for both light and dark modes using HSL color space.",
  "frontend/src/lib/utils.ts": "Utility function combining clsx and tailwind-merge to merge Tailwind CSS class names with proper conflict resolution.",
  "frontend/src/main.tsx": "Application entry point that renders the root component wrapped with QueryClientProvider for React Query and InternetIdentityProvider for ICP authentication.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom theme extensions including color schemes using OKLCH format, typography with Inter font, container settings, border radius variables, custom shadows, and animation keyframes for accordion components.",
  "project_state.json": "Project state tracking file for J M Construction website, documenting 8 existing features (homepage, about, services, contact sections with professional design), architectural notes about Kolkata-based sanitary/plumbing contractor specializing in new residential apartments only, and contact email jmconstruction.sp@gmail.com."
}