{
  "backend/main.mo": "Motoko actor that manages contact form submissions with functions to submit, retrieve by ID, and get all contact entries sorted by timestamp.",
  "feature_evidence.json": "Feature evidence report documenting the replacement of the company logo in the Hero section with the new J M Construction logo.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files including components, hooks, styles, and configuration for the J M Construction website.",
  "frontend/index.css": "Tailwind CSS base styles with OKLCH color system defining warm, construction-appropriate color variables for light and dark modes.",
  "frontend/index.html": "HTML entry point for the React application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Main React component that renders the single-page website layout with Hero, About, Services, Contact, and Footer sections.",
  "frontend/src/components/About.tsx": "About section component showcasing J M Construction's 30-year heritage, 8 years of expertise, and four key value propositions with icons.",
  "frontend/src/components/Contact.tsx": "Contact section displaying company location, email (with mailto link), business hours, trust badges, and the ContactForm component.",
  "frontend/src/components/ContactForm.tsx": "Form component with validation that submits contact entries to the backend actor and displays success/error states with loading indicators.",
  "frontend/src/components/Footer.tsx": "Footer component displaying company info, quick links, services list, copyright notice, and a Caffeine.ai attribution link with dynamic app identifier.",
  "frontend/src/components/Hero.tsx": "Hero section component featuring company logo, name, location (Kolkata), tagline, stats grid (8 years experience, 30 years heritage), CTA button, and animated scroll indicator over a background image.",
  "frontend/src/components/Services.tsx": "Services section component displaying six service cards (sanitary, plumbing, repairs, residential, commercial, upgrades) with an alert notice specifying focus on new residential apartments only.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor instance based on Internet Identity authentication state, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Custom React Query hooks for contact entry operations: submitting new entries (mutation) and fetching all or individual contact entries (queries) using the backend actor.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a warm, earthy construction-themed color palette for both light and dark modes using OKLCH color space.",
  "frontend/src/lib/utils.ts": "Utility function combining clsx and tailwind-merge for conditional className merging in React components.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider and InternetIdentityProvider wrappers around the main App component.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom theme extensions including color schemes using OKLCH format, typography with Inter font, container settings, border radius variables, custom shadows, and keyframe animations for accordions and other UI elements.",
  "project_state.json": "Project state file documenting J M Construction website requirements, including company details (Kolkata-based sanitary/plumbing contractor with 8 years experience), architectural notes, and existing features covering homepage, about, services, and contact sections with emphasis on new residential apartments only."
}